[
  {
    "Id": "186370",
    "ThreadId": "55207",
    "Html": "Is there anything in the code since the Feb alpha release to help with comment spam?  I'm getting crushed with it.  ALL kinds of comment spam, every day.\r\n",
    "PostedDate": "2009-05-03T19:15:39.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "186413",
    "ThreadId": "55207",
    "Html": "Yah, check out $/Oxite/Implementations/MIXVideos ...we're doing spam checking there.  In the main branch I'm still finishing out the plugin model, but once that is done, the first plugin we're going to write to be included with the next release is a spam filter plugin.<br>\r\n<br>\r\nYou can also just set the default comment state to be pending so at least none of the spam will go live.  That's what I've done on my site for now.  Makes it a pain since you have to then go through them yourself, but stops spam from getting on your site at least for now.\r\n",
    "PostedDate": "2009-05-03T23:46:55.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190703",
    "ThreadId": "55207",
    "Html": "<p>I can't WAIT.&nbsp; I am getting 100's of spam comments a day.&nbsp; Why oh WHY!&nbsp; Ok, anyway, I'll check out MIX and see if I can get anything out of there to work quickly.</p>\r\n<p>Happy three month birthday of Alpha release.</p>",
    "PostedDate": "2009-05-15T05:56:33.42-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "190829",
    "ThreadId": "55207",
    "Html": "<p>Cool.&nbsp; Let me know if you need any help.&nbsp; I get a ton of spam too.&nbsp; Not too bad since I just set the default comment state to pending and can clean them up when I have time.</p>\r\n<p>I'd suggest you look at how we're doing plugins now (with the current checkins) because there's already an event for spam checking, but there are unfortunately a ton of architectural changes that you'd have to bring in too.</p>\r\n<p>Ouch.&nbsp; Don't remind me.&nbsp; We're hurrying, but won't put out a release until we feel this version is ready.&nbsp; We want this to be the first Beta.&nbsp; And by we, I mean me.&nbsp; :)</p>",
    "PostedDate": "2009-05-15T10:58:15.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]